[
  {
  "imageUrl": "https://kt-public-images.s3.us-east-2.amazonaws.com/news/img-chatbot-404.jpg",  
  "title": "Kick WebSocket Issues",
  "date": "February 1, 2025",
  "content": "Kick is transitioning its WebSocket events system, causing some channels to miss event data like subs and gifts. This is an issue on Kick's side; all KickTools widgets and servers are running normally. We are waiting for Kick to either release official API access or stabilize event broadcasting for all channels. Affected widgets include sub goals and hype trains. We will update you as soon as a fix is available."
},
  {
    "imageUrl": "https://kt-public-images.s3.us-east-2.amazonaws.com/news/img-chatbot-404.jpg",
    "title": "Chatbot Service Restored",
    "date": "January 28, 2025",
    "content": "We are pleased to announce that our KickTools Chatbot is now fully operational again. The authorization issues with Kick have been resolved, and the chatbot is back to providing responses within the chat environment. Thank you for your patience during this time. Our widgets have continued to function normally throughout this period."
},
  {
    "imageUrl": "https://kt-public-images.s3.us-east-2.amazonaws.com/news/img-dennako_designs.jpg",
    "title": "Creator Poster Templates",
    "date": "January 25, 2025",
    "content": "Introducing Creator Poster Templates on KickTools! Now create stunning, high-definition posters directly from your dashboard with templates designed by your favorite Kick artists like Denny on Kick. More templates and artists coming soon!",
    "footerLink": {
      "text": "Create Now",
      "url": "/tools/creator"
    }
  },
  {
    "imageUrl": "https://kt-public-images.s3.us-east-2.amazonaws.com/news/img-tawkto.jpg",
    "title": "Live Support",
    "date": "January 22, 2025",
    "content": "Introducing Tawk.to Live Support for KickTools! Get widget help directly from the dashboard via \"Live Chat\" button right from the KickTools Dashboard. Please be patient for responses as we're a small team."
  },
  {
    "imageUrl": "https://kt-public-images.s3.us-east-2.amazonaws.com/news/img-welcome.jpg",
    "title": "KickTools Says Hello",
    "date": "January 1, 2025",
    "content": "Thank you for signing up! The dashboard is new, and we're working on adding more exciting features. Stay tuned for updates!"
  },
    {
    "imageUrl": "https://kt-public-images.s3.us-east-2.amazonaws.com/news/img-chatbot-404.jpg",
    "title": "Chatbot Currently Down",
    "date": "January 27, 2025",
    "content": "We apologize for the inconvenience, but our KickTools Chatbot is currently unavailable. We are experiencing issues with authorization from Kick and are actively working on resolving this matter. Please note that this issue does not affect the functionality of our widgets; they continue to operate as expected. The chatbot is solely for providing responses within the chat environment."
  }
]
